cfd/conv_1e6f/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    corpo    { type zeroGradient; }

    uscita   { type fixedValue; value uniform 0; }
    esterno  { type freestreamPressure; freestreamValue uniform 0; }
    front    { type wedge; }
    back     { type wedge; }
    asse     { type empty; }
}
